{"config": [{"config": {"name": "input_conv1", "trainable": true, "W_constraint": null, "nb_filter": 3, "batch_input_shape": [null, 32, 32, 3], "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "input_dtype": "float32", "nb_row": 1, "activation": "relu", "b_regularizer": null, "b_constraint": null, "nb_col": 1, "border_mode": "same", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "block1_conv1", "trainable": true, "activity_regularizer": null, "nb_filter": 64, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "nb_row": 3, "activation": "relu", "b_constraint": null, "nb_col": 3, "border_mode": "same", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "block1_pool", "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "block2_conv1", "trainable": true, "activity_regularizer": null, "nb_filter": 32, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "nb_row": 3, "activation": "relu", "b_constraint": null, "nb_col": 3, "border_mode": "same", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "block2_pool", "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "block3_conv1", "trainable": true, "activity_regularizer": null, "nb_filter": 16, "W_constraint": null, "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "nb_row": 3, "activation": "relu", "b_constraint": null, "nb_col": 3, "border_mode": "same", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "block3_pool", "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flat", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "fc1", "input_dim": 256, "trainable": true, "W_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 256], "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "input_dtype": "float32", "activation": "linear", "b_constraint": null, "output_dim": 1024}, "class_name": "Dense"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "fc1_dropout", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "fc2", "input_dim": 1024, "trainable": true, "W_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 1024], "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "input_dtype": "float32", "activation": "linear", "b_constraint": null, "output_dim": 128}, "class_name": "Dense"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "fc2_dropout", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "fc3", "input_dim": 128, "trainable": true, "W_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 128], "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "input_dtype": "float32", "activation": "linear", "b_constraint": null, "output_dim": 64}, "class_name": "Dense"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "fc3_dropout", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "fc4", "input_dim": 64, "trainable": true, "W_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 64], "b_regularizer": null, "init": "glorot_uniform", "bias": true, "W_regularizer": null, "input_dtype": "float32", "activation": "linear", "b_constraint": null, "output_dim": 32}, "class_name": "Dense"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "fc4_dropout", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "output", "input_dim": 32, "trainable": true, "W_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 32], "b_regularizer": null, "init": "zero", "bias": true, "W_regularizer": null, "input_dtype": "float32", "activation": "linear", "b_constraint": null, "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.2.1", "class_name": "Sequential"}